In [6]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('adult_data.csv')
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [3]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [11]:
df[df['sex'] == 'Female']['age'].mean()

36.85823043357163

In [12]:
df['native-country'][df['native-country'] == 'Germany'].value_counts() / len(df)

Germany    0.004207
Name: native-country, dtype: float64

In [6]:
df.groupby(['salary'])['age'].agg([np.mean, np.std])

             mean        std
salary
<=50K   36.783738  14.020088
>50K    44.249841  10.519028

In [13]:
df['education'][df['salary'] == '>50K'].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

In [8]:
df.groupby(['sex', 'race'])['age'].describe(percentiles=[])

                             count       mean        std   min   50%   max
sex    race
Female Amer-Indian-Eskimo    119.0  37.117647  13.114991  17.0  36.0  80.0
       Asian-Pac-Islander    346.0  35.089595  12.300845  17.0  33.0  75.0
       Black                1555.0  37.854019  12.637197  17.0  37.0  90.0
       Other                 109.0  31.678899  11.631599  17.0  29.0  74.0
       White                8642.0  36.811618  14.329093  17.0  35.0  90.0
Male   Amer-Indian-Eskimo    192.0  37.208333  12.049563  17.0  35.0  82.0
       Asian-Pac-Islander    693.0  39.073593  12.883944  18.0  37.0  90.0
       Black                1569.0  37.682600  12.882612  17.0  36.0  90.0
       Other                 162.0  34.654321  11.355531  17.0  32.0  77.0
       White               19174.0  39.652498  13.436029  17.0  38.0  90.0

In [14]:
print('Married : ', df['marital-status'][df['marital-status'].str.startswith('Mar')]
      [df['sex'] == 'Male'][df['salary'] == '>50K'].value_counts().sum() / len(df))
print('Unmarried: ', df['marital-status'][df['marital-status'].str.endswith('d')]
     [df['sex'] == 'Male'][df['salary'] == '>50K'].value_counts().sum() / len(df), '\n')

Married :  0.18319461932987316
Unmarried:  0.02140597647492399

In [13]:
print(df['hours-per-week'][df['hours-per-week'] == df['hours-per-week'].max()].value_counts())
pd.crosstab(df['hours-per-week'][df['hours-per-week'] == df['hours-per-week'].max()],
           df['salary'], normalize=True)

99    85
Name: hours-per-week, dtype: int64

salary             <=50K      >50K
hours-per-week
99              0.705882  0.294118

In [14]:
df.pivot_table(['hours-per-week'], ['native-country', 'salary'], aggfunc='mean')[43:53]

                       hours-per-week
native-country salary
Italy          <=50K        39.625000
               >50K         45.400000
Jamaica        <=50K        38.239437
               >50K         41.100000
Japan          <=50K        41.000000
               >50K         47.958333
Laos           <=50K        40.375000
               >50K         40.000000
Mexico         <=50K        40.003279
               >50K         46.575758